<h1>IO Tools</h1>

En Pandas podemos importar y exportar diferentes tipos de archivos

como:

<ul>
    <li>CSV</li>
    <li>Tablas HTML</li>
    <li>JSON</li>
    <li>BBDD SQL</li>
</ul>

In [1]:
import pandas as pd
import os

In [2]:
os.getcwd()

'c:\\Users\\Erik\\Documents\\Data Engineering\\Pandas'

In [3]:
os.listdir()

['.ipynb_checkpoints',
 '01.-introduccion.ipynb',
 '02.-dataframes.ipynb',
 '03.-useful-methods.ipynb',
 '04.-pandas-operations.ipynb',
 '05.-mergin.ipynb',
 '06.-metodos-texto.ipynb',
 '07.-time-methods.ipynb',
 '08.-io-tools.ipynb',
 'assets']

<h2>CSV Files</h2>

In [4]:
# leer csv
df = pd.read_csv('./assets/example.csv')

In [5]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [6]:
df['a+d'] = df.a + df.d

In [7]:
df

    a   b   c   d  a+d
0   0   1   2   3    3
1   4   5   6   7   11
2   8   9  10  11   19
3  12  13  14  15   27

In [8]:
# exportar csv
df.to_csv('./assets/new-example.csv')

<h2>HTML Files</h2>

<ul>
    <li>No todas las tablas de un website son tablas de HTML</li>
    <li>Algunos sitios bloquean la posibilidad de hacer scraping</li>
    <li>Para prevenir todo esto es mejor usar una API</li>
</ul>

In [9]:
url = 'https://en.wikipedia.org/wiki/World_population'

In [10]:
tables = pd.read_html(url)

In [11]:
len(tables)

26

In [12]:
tables[0]

        World population (millions, UN estimates)[14]  \
                                                    #
0                                                   1
1                                                   2
2                                                   3
3                                                   4
4                                                   5
5                                                   6
6                                                   7
7                                                   8
8                                                   9
9                                                  10
10                                                NaN
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                      Top ten most populous countries
0                                            China[B]
1                                               India
2                                       United States
3                                           Indonesia
4                                            Pakistan
5                                              Brazil
6                                             Nigeria
7                                          Bangladesh
8                                              Russia
9                                              Mexico
10                                        World total
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2000
0                                                1270
1                                                1053
2                                                 283
3                                                 212
4                                                 136
5                                                 176
6                                                 123
7                                                 131
8                                                 146
9                                                 103
10                                               6127
11  Notes: .mw-parser-output .reflist{font-size:90...

                                                       \
                                                 2015
0                                                1376
1                                                1311
2                                                 322
3                                                 258
4                                                 208
5                                                 206
6                                                 182
7                                                 161
8                                                 146
9                                                 127
10                                               7349
11  Notes: .mw-parser-output .reflist{font-size:90...


                                              2030[A]
0                                                1416
1                                                1528
2                                                 356
3                                                 295
4                                                 245
5                                                 228
6                                                 263
7                                                 186
8                                                 149
9                                                 148
10                                               8501
11  Notes: .mw-parser-output .reflist{font-size:90...

In [13]:
tables[0].columns

MultiIndex([('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...),
            ('World population (millions, UN estimates)[14]', ...)],
           )

In [14]:
world_topten = tables[0]

In [15]:
world_topten = world_topten['World population (millions, UN estimates)[14]']

In [16]:
world_topten

,#,Top ten most populous countries,2000,2015,2030[A]
0,1,China[B],1270,1376,1416
1,2,India,1053,1311,1528
2,3,United States,283,322,356
3,4,Indonesia,212,258,295
4,5,Pakistan,136,208,245
5,6,Brazil,176,206,228
6,7,Nigeria,123,182,263
7,8,Bangladesh,131,161,186
8,9,Russia,146,146,149
9,10,Mexico,103,127,148
10,NaN,World total,6127,7349,8501
11,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...,Notes: .mw-parser-output .reflist{font-size:90...

In [17]:
world_topten = world_topten.drop(11, axis=0)

In [18]:
world_topten

      # Top ten most populous countries  2000  2015 2030[A]
0     1                        China[B]  1270  1376    1416
1     2                           India  1053  1311    1528
2     3                   United States   283   322     356
3     4                       Indonesia   212   258     295
4     5                        Pakistan   136   208     245
5     6                          Brazil   176   206     228
6     7                         Nigeria   123   182     263
7     8                      Bangladesh   131   161     186
8     9                          Russia   146   146     149
9    10                          Mexico   103   127     148
10  NaN                     World total  6127  7349    8501

In [19]:
world_topten = world_topten.drop('#', axis=1)

In [20]:
world_topten

   Top ten most populous countries  2000  2015 2030[A]
0                         China[B]  1270  1376    1416
1                            India  1053  1311    1528
2                    United States   283   322     356
3                        Indonesia   212   258     295
4                         Pakistan   136   208     245
5                           Brazil   176   206     228
6                          Nigeria   123   182     263
7                       Bangladesh   131   161     186
8                           Russia   146   146     149
9                           Mexico   103   127     148
10                     World total  6127  7349    8501

In [21]:
world_topten.columns = ['Country', '2000', '2015', '2030 Est.']

In [22]:
world_topten

          Country  2000  2015 2030 Est.
0        China[B]  1270  1376      1416
1           India  1053  1311      1528
2   United States   283   322       356
3       Indonesia   212   258       295
4        Pakistan   136   208       245
5          Brazil   176   206       228
6         Nigeria   123   182       263
7      Bangladesh   131   161       186
8          Russia   146   146       149
9          Mexico   103   127       148
10    World total  6127  7349      8501

In [23]:
# exportar tabla html
world_topten.to_html('./assets/sample_table.html', index=False)

<h1>Excel Files</h1>
<p>
    Pandas solo puede leer hojas de calculo de Excel sin macroso o visualizaciones,
    o formulas
</p>

<stron>Para manejar Excel con Pandas debemos istalar una libreria como openxl</strong>

In [24]:
df = pd.read_excel('./assets/my_excel_file.xlsx', sheet_name='Sheet1')

In [25]:
df

    a   b   c   d
0   0   1   2   9
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

<h2>Extraer un WorkBook<h2>

In [26]:
wb = pd.ExcelFile('./assets/my_excel_file.xlsx')

In [27]:
wb.sheet_names

['Sheet1']

In [28]:
excel_sheet_dict = pd.read_excel('./assets/my_excel_file.xlsx', sheet_name=None)

In [29]:
type(excel_sheet_dict)

dict

In [30]:
excel_sheet_dict.keys()

dict_keys(['Sheet1'])

In [31]:
excel_sheet_dict['Sheet1']

    a   b   c   d
0   0   1   2   9
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [32]:
df['mean'] = df.mean(axis=1)

In [33]:
df.to_excel('./assets/example.xlsx')

<h1>SQL Databases</h1>

Pandas puede leer y escribir en algunos motores de Base de Datos

mediante el uso de un driver y de la libreria **sqlalchemt**

<h2>Pasos para manejar SQL a traves de Pandas</h2>
<ul>
    <li><h3><strong>Paso 1:</strong></h3></li>
    <p> Averigua a que motor SQL estas conectado, como:</p>
    <ul>
        <li>PostgreSQL</li>
        <li>MySQL</li>
        <li>MS SQL Server</li>
    </ul>
</ul>

<ul>
    <li><h3><strong>Paso 2:</strong></h3></li>
    <p> Instala el driver o libreria o conector de Python correspondiente a tu BBDD </p>
    <ul>
        <li>PostgreSQL - psycopg2</li>
        <li>MySQL - pymysql o mysql-connector-python </li>
        <li>MS SQL Server - pyodbc</li>
    </ul>
</ul>

<ul>
    <li><h3><strong>Paso 3:</strong></h3></li>
    <ul>
        <li>Usar sqlalchemy para conectarse con la base de datos SQL</li>
    </ul>
</ul>

<ul>
    <li><h3><strong>Paso 4:</strong></h3></li>
    <ul>
        <li>Usa la coneccion de sqlalchemy driver con el metodo de pandas read_sql() </li>
        <li>Pandas puede leer toda una tabla como DataFrame o pasar una query SQL </li>
    </ul>
</ul>

In [36]:
from sqlalchemy import create_engine
import numpy as np

In [35]:
temp_db = create_engine('sqlite:///:memory:')

In [41]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])

In [42]:
df

    a   b   c   d
0  41  57  71   2
1  56   4   7  24
2  41  71  39  47
3  78  71  54  16

In [43]:
df.to_sql(name='new_table', con=temp_db)

In [44]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [45]:
new_df

   index   a   b   c   d
0      0  41  57  71   2
1      1  56   4   7  24
2      2  41  71  39  47
3      3  78  71  54  16

In [46]:
pd.read_sql_query(sql= 'SELECT a,c FROM new_table', con=temp_db)

    a   c
0  41  71
1  56   7
2  41  39
3  78  54